In [67]:
import pandas as pd

In [68]:
f1 = pd.read_csv('data/daily_sales_data_0.csv')

In [69]:
f1.head(5)

       product  price  quantity        date region
0  pink morsel  $3.00       546  2018-02-06  north
1  pink morsel  $3.00       549  2018-02-06  south
2  pink morsel  $3.00       577  2018-02-06   east
3  pink morsel  $3.00       519  2018-02-06   west
4  gold morsel  $9.99       580  2018-02-06  north

In [70]:
f1[f1['product']=='pink morsel']

           product  price  quantity        date region
0      pink morsel  $3.00       546  2018-02-06  north
1      pink morsel  $3.00       549  2018-02-06  south
2      pink morsel  $3.00       577  2018-02-06   east
3      pink morsel  $3.00       519  2018-02-06   west
28     pink morsel  $3.00       529  2018-02-07  north
...            ...    ...       ...         ...    ...
13667  pink morsel  $3.00       599  2019-06-09   west
13692  pink morsel  $3.00       566  2019-06-10  north
13693  pink morsel  $3.00       563  2019-06-10  south
13694  pink morsel  $3.00       541  2019-06-10   east
13695  pink morsel  $3.00       589  2019-06-10   west

[1960 rows x 5 columns]

In [71]:
pm_f1 = f1[f1['product']=='pink morsel']

In [72]:
pm_f1['price'] = (
    pm_f1['price']
    .astype(str)
    .str.replace(r'[^0-9.]', '', regex=True)
    .astype(float)
)

In [73]:
pm_f1['sales'] = pm_f1['price']*pm_f1['quantity']

In [74]:
filtered_f1 = pm_f1[['product', 'sales', 'date', 'region']]

In [75]:
filtered_f1.head()

        product   sales        date region
0   pink morsel  1638.0  2018-02-06  north
1   pink morsel  1647.0  2018-02-06  south
2   pink morsel  1731.0  2018-02-06   east
3   pink morsel  1557.0  2018-02-06   west
28  pink morsel  1587.0  2018-02-07  north

In [76]:
filtered_f1['product'].count()

np.int64(1960)

In [77]:
filtered_f1.head()

        product   sales        date region
0   pink morsel  1638.0  2018-02-06  north
1   pink morsel  1647.0  2018-02-06  south
2   pink morsel  1731.0  2018-02-06   east
3   pink morsel  1557.0  2018-02-06   west
28  pink morsel  1587.0  2018-02-07  north

In [78]:
f2 = pd.read_csv('data/daily_sales_data_1.csv')

In [79]:
f3 = pd.read_csv('data/daily_sales_data_2.csv')

In [80]:
pm_f2 = f2[f2['product']=='pink morsel']
pm_f2['price'] = (
    pm_f2['price']
    .astype(str)
    .str.replace(r'[^0-9.]', '', regex=True)
    .astype(float)
)
pm_f2['sales'] = pm_f2['price']*pm_f2['quantity']
filtered_f2 = pm_f2[['product', 'sales', 'date', 'region']]

In [81]:
pm_f3 = f3[f3['product']=='pink morsel']
pm_f3['price'] = (
    pm_f3['price']
    .astype(str)
    .str.replace(r'[^0-9.]', '', regex=True)
    .astype(float)
)
pm_f3['sales'] = pm_f3['price']*pm_f3['quantity']
filtered_f3 = pm_f3[['product', 'sales', 'date', 'region']]

In [82]:
f = pd.concat([filtered_f1, filtered_f2, filtered_f3], ignore_index=True)

In [83]:
f.head()

       product   sales        date region
0  pink morsel  1638.0  2018-02-06  north
1  pink morsel  1647.0  2018-02-06  south
2  pink morsel  1731.0  2018-02-06   east
3  pink morsel  1557.0  2018-02-06   west
4  pink morsel  1587.0  2018-02-07  north

In [85]:
final_data = f[['sales', 'date', 'region']]

In [86]:
final_data.head()

    sales        date region
0  1638.0  2018-02-06  north
1  1647.0  2018-02-06  south
2  1731.0  2018-02-06   east
3  1557.0  2018-02-06   west
4  1587.0  2018-02-07  north

In [87]:
final_data.to_csv('final_data.csv', index=False)